# MySQL in Azure

In [3]:
import pymysql #package that use python handling mySQL

In [4]:
host_name = 'host_address'
user_name = 'user_name'
password = 'password'
database_name = 'classicmodels' 

#after make database on Azure, get information needed
#use sample database mySQL provide

In [5]:
db = pymysql.connect(
    host = host_name,
    port = 3306,
    user = user_name,
    password = password,
    db = database_name,
    charset='utf8', 
    ssl={'fake_flag_to_enable_tls':True}
)

In [6]:
import pandas as pd

SQL = 'SELECT * FROM employees'
df = pd.read_sql(SQL, db)

type(df)

C:\Users\tak_jj\AppData\Local\Temp\ipykernel_11612\1736828700.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(SQL, db)

pandas.core.frame.DataFrame

In [7]:
df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

In [8]:
SQL = '''
CREATE TABLE tempTable(
    id int AUTO_INCREMENT,
    user_name varchar(10) NOT NULL,
    phone varchar(30) NULL,
    PRIMARY KEY(id)
)
'''
#varchar, fluid than char, use storage space just inputted, slower than char

cursor = db.cursor()
cursor.execute(SQL)
cursor.close()

In [9]:
SQL = 'INSERT INTO tempTable(user_name, phone) VALUES("BTS", "010-1234-5678")'

cursor = db.cursor()
cursor.execute(SQL)
cursor.close()

In [10]:
SQL = 'SELECT * FROM tempTable'
df = pd.read_sql(SQL, db)
df

C:\Users\tak_jj\AppData\Local\Temp\ipykernel_11612\2566667462.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(SQL, db)

   id user_name          phone
0   1       BTS  010-1234-5678